In [1]:
import pandas as pd
from glob import glob
from re import match

In [52]:
CSVs = glob('data/*/*.csv')

for csv in CSVs:
    file = match(r'data.*/(.*?)\.csv', csv).group(1)
    print(file)
    exec(f'{file} = pd.read_csv("{csv}", parse_dates=["DATETIME"], date_format="%d/%m/%Y %H:%M")')

temprature_qld
totaldemand_qld
temprature_sa
totaldemand_sa
forecastdemand_qld
forecastdemand_vic
totaldemand_vic
forecastdemand_sa
temprature_vic
totaldemand_nsw
forecastdemand_nsw
temperature_nsw

In [ ]:
pd.read_csv()

In [54]:
temprature_qld

                            LOCATION            DATETIME  TEMPERATURE
0       Brisbane Archerfield Airport 2010-01-01 00:00:00         23.6
1       Brisbane Archerfield Airport 2010-01-01 00:30:00         23.7
2       Brisbane Archerfield Airport 2010-01-01 01:00:00         23.5
3       Brisbane Archerfield Airport 2010-01-01 01:30:00         22.6
4       Brisbane Archerfield Airport 2010-01-01 02:00:00         22.0
...                              ...                 ...          ...
208080  Brisbane Archerfield Airport 2021-03-17 22:00:00         19.6
208081  Brisbane Archerfield Airport 2021-03-17 22:30:00         19.5
208082  Brisbane Archerfield Airport 2021-03-17 23:00:00         19.4
208083  Brisbane Archerfield Airport 2021-03-17 23:30:00         19.6
208084  Brisbane Archerfield Airport 2021-03-18 00:00:00         19.5

[208085 rows x 3 columns]

In [30]:
totaldemand_qld

                   DATETIME  TOTALDEMAND REGIONID
0       2010-01-01 00:00:00      5561.21     QLD1
1       2010-01-01 00:30:00      5422.25     QLD1
2       2010-01-01 01:00:00      5315.98     QLD1
3       2010-01-01 01:30:00      5186.70     QLD1
4       2010-01-01 02:00:00      5050.83     QLD1
...                     ...          ...      ...
196508  2021-03-17 22:00:00      6443.62     QLD1
196509  2021-03-17 22:30:00      6264.63     QLD1
196510  2021-03-17 23:00:00      6144.16     QLD1
196511  2021-03-17 23:30:00      5897.64     QLD1
196512  2021-03-18 00:00:00      5737.03     QLD1

[196513 rows x 3 columns]

In [31]:
temprature_sa

        Unnamed: 0              LOCATION             DATETIME  TEMPERATURE
0                0  Adelaide (Kent Town)  2010-01-01 00:00:00         23.6
1                1  Adelaide (Kent Town)  2010-01-01 00:30:00         23.7
2                2  Adelaide (Kent Town)  2010-01-01 01:00:00         23.5
3                3  Adelaide (Kent Town)  2010-01-01 01:30:00         22.6
4                4  Adelaide (Kent Town)  2010-01-01 02:00:00         22.0
...            ...                   ...                  ...          ...
208080      208080  Adelaide (Kent Town)  2021-03-17 22:00:00         19.6
208081      208081  Adelaide (Kent Town)  2021-03-17 22:30:00         19.5
208082      208082  Adelaide (Kent Town)  2021-03-17 23:00:00         19.4
208083      208083  Adelaide (Kent Town)  2021-03-17 23:30:00         19.6
208084      208084  Adelaide (Kent Town)  2021-03-18 00:00:00         19.5

[208085 rows x 4 columns]

In [32]:
totaldemand_sa

                   DATETIME  TOTALDEMAND REGIONID
0       2010-01-01 00:30:00      1385.23      SA1
1       2010-01-01 01:00:00      1338.53      SA1
2       2010-01-01 01:30:00      1260.39      SA1
3       2010-01-01 02:00:00      1189.31      SA1
4       2010-01-01 02:30:00      1141.12      SA1
...                     ...          ...      ...
196507  2021-03-17 22:00:00      1277.91      SA1
196508  2021-03-17 22:30:00      1226.81      SA1
196509  2021-03-17 23:00:00      1202.62      SA1
196510  2021-03-17 23:30:00      1194.34      SA1
196511  2021-03-18 00:00:00      1340.58      SA1

[196512 rows x 3 columns]

In [33]:
forecastdemand_qld

,PREDISPATCHSEQNO,REGIONID,PERIODID,FORECASTDEMAND,LASTCHANGED,DATETIME
0,2016123018,QLD1,71,6425.36,2016-12-30 12:31:25,2017-01-01 00:00:00
1,2016123018,QLD1,72,6193.34,2016-12-30 12:31:25,2017-01-01 00:30:00
2,2016123018,QLD1,73,6016.45,2016-12-30 12:31:25,2017-01-01 01:00:00
3,2016123018,QLD1,74,5859.23,2016-12-30 12:31:25,2017-01-01 01:30:00
4,2016123018,QLD1,75,5767.15,2016-12-30 12:31:25,2017-01-01 02:00:00
...,...,...,...,...,...,...
4095587,2021031740,QLD1,53,5600.29,2021-03-17 23:31:33,2021-03-19 02:00:00
4095588,2021031740,QLD1,54,5570.50,2021-03-17 23:31:33,2021-03-19 02:30:00
4095589,2021031740,QLD1,55,5549.37,2021-03-17 23:31:33,2021-03-19 03:00:00
4095590,2021031740,QLD1,56,5545.07,2021-03-17 23:31:33,2021-03-19 03:30:00
4095591,2021031740,QLD1,57,5564.29,2021-03-17 23:31:33,2021-03-19 04:00:00

In [34]:
forecastdemand_vic

,PREDISPATCHSEQNO,REGIONID,PERIODID,FORECASTDEMAND,LASTCHANGED,DATETIME
0,2016123018,VIC1,71,4160.74,2016-12-30 12:31:25,2017-01-01 00:00:00
1,2016123018,VIC1,72,3999.64,2016-12-30 12:31:25,2017-01-01 00:30:00
2,2016123018,VIC1,73,3836.30,2016-12-30 12:31:25,2017-01-01 01:00:00
3,2016123018,VIC1,74,3681.87,2016-12-30 12:31:25,2017-01-01 01:30:00
4,2016123018,VIC1,75,3457.38,2016-12-30 12:31:25,2017-01-01 02:00:00
...,...,...,...,...,...,...
4095587,2021031740,VIC1,53,4127.05,2021-03-17 23:31:33,2021-03-19 02:00:00
4095588,2021031740,VIC1,54,4044.25,2021-03-17 23:31:33,2021-03-19 02:30:00
4095589,2021031740,VIC1,55,3997.18,2021-03-17 23:31:33,2021-03-19 03:00:00
4095590,2021031740,VIC1,56,3982.65,2021-03-17 23:31:33,2021-03-19 03:30:00
4095591,2021031740,VIC1,57,3999.31,2021-03-17 23:31:33,2021-03-19 04:00:00

In [35]:
totaldemand_vic

                   DATETIME  TOTALDEMAND REGIONID
0       2010-01-01 00:00:00      5426.12     VIC1
1       2010-01-01 00:30:00      5111.02     VIC1
2       2010-01-01 01:00:00      4960.03     VIC1
3       2010-01-01 01:30:00      5283.40     VIC1
4       2010-01-01 02:00:00      5046.15     VIC1
...                     ...          ...      ...
196508  2021-03-17 22:00:00      4557.56     VIC1
196509  2021-03-17 22:30:00      4485.95     VIC1
196510  2021-03-17 23:00:00      4434.62     VIC1
196511  2021-03-17 23:30:00      4660.85     VIC1
196512  2021-03-18 00:00:00      4608.85     VIC1

[196513 rows x 3 columns]

In [36]:
forecastdemand_sa

,PREDISPATCHSEQNO,REGIONID,PERIODID,FORECASTDEMAND,LASTCHANGED,DATETIME
0,2016123018,SA1,71,1394.41,2016-12-30 12:31:25,2017-01-01 00:00:00
1,2016123018,SA1,72,1285.07,2016-12-30 12:31:25,2017-01-01 00:30:00
2,2016123018,SA1,73,1221.70,2016-12-30 12:31:25,2017-01-01 01:00:00
3,2016123018,SA1,74,1141.86,2016-12-30 12:31:25,2017-01-01 01:30:00
4,2016123018,SA1,75,1087.78,2016-12-30 12:31:25,2017-01-01 02:00:00
...,...,...,...,...,...,...
4095587,2021031740,SA1,53,1228.07,2021-03-17 23:31:33,2021-03-19 02:00:00
4095588,2021031740,SA1,54,1208.17,2021-03-17 23:31:33,2021-03-19 02:30:00
4095589,2021031740,SA1,55,1199.27,2021-03-17 23:31:33,2021-03-19 03:00:00
4095590,2021031740,SA1,56,1194.31,2021-03-17 23:31:33,2021-03-19 03:30:00
4095591,2021031740,SA1,57,1190.41,2021-03-17 23:31:33,2021-03-19 04:00:00

In [37]:
temprature_vic

                        LOCATION            DATETIME  TEMPERATURE
0       Melbourne (Olympic Park) 2013-05-31 15:00:00         18.2
1       Melbourne (Olympic Park) 2013-05-31 15:30:00         18.3
2       Melbourne (Olympic Park) 2013-05-31 16:00:00         18.3
3       Melbourne (Olympic Park) 2013-05-31 16:30:00         18.3
4       Melbourne (Olympic Park) 2013-05-31 17:00:00         18.2
...                          ...                 ...          ...
141676  Melbourne (Olympic Park) 2021-03-17 22:00:00         18.9
141677  Melbourne (Olympic Park) 2021-03-17 22:30:00         17.9
141678  Melbourne (Olympic Park) 2021-03-17 23:00:00         17.3
141679  Melbourne (Olympic Park) 2021-03-17 23:30:00         16.6
141680  Melbourne (Olympic Park) 2021-03-18 00:00:00         15.8

[141681 rows x 3 columns]

In [38]:
totaldemand_nsw

                  DATETIME  TOTALDEMAND REGIONID
0      2010-01-01 00:00:00      8038.00     NSW1
1      2010-01-01 00:30:00      7809.31     NSW1
2      2010-01-01 01:00:00      7483.69     NSW1
3      2010-01-01 01:30:00      7117.23     NSW1
4      2010-01-01 02:00:00      6812.03     NSW1
...                    ...          ...      ...
196508 2021-03-17 22:00:00      7419.77     NSW1
196509 2021-03-17 22:30:00      7417.91     NSW1
196510 2021-03-17 23:00:00      7287.32     NSW1
196511 2021-03-17 23:30:00      7172.39     NSW1
196512 2021-03-18 00:00:00      7094.51     NSW1

[196513 rows x 3 columns]

In [60]:
forecastdemand_nsw

,PREDISPATCHSEQNO,REGIONID,PERIODID,FORECASTDEMAND,LASTCHANGED,DATETIME
0,2009123018,NSW1,71,7832.04,2009-12-30 12:31:49,2010-01-01 00:00:00
1,2009123019,NSW1,70,7832.04,2009-12-30 13:01:43,2010-01-01 00:00:00
2,2009123020,NSW1,69,7832.03,2009-12-30 13:31:36,2010-01-01 00:00:00
3,2009123021,NSW1,68,7832.03,2009-12-30 14:01:44,2010-01-01 00:00:00
4,2009123022,NSW1,67,7830.96,2009-12-30 14:31:35,2010-01-01 00:00:00
...,...,...,...,...,...,...
10906014,2021031736,NSW1,5,7028.45,2021-03-17 21:31:31,2021-03-18 00:00:00
10906015,2021031737,NSW1,4,7041.65,2021-03-17 22:01:34,2021-03-18 00:00:00
10906016,2021031738,NSW1,3,7087.60,2021-03-17 22:31:36,2021-03-18 00:00:00
10906017,2021031739,NSW1,2,7087.28,2021-03-17 23:01:36,2021-03-18 00:00:00
10906018,2021031740,NSW1,1,7126.37,2021-03-17 23:31:33,2021-03-18 00:00:00

In [57]:
temperature_nsw

         LOCATION            DATETIME  TEMPERATURE
0       Bankstown 2010-01-01 00:00:00         23.1
1       Bankstown 2010-01-01 00:01:00         23.1
2       Bankstown 2010-01-01 00:30:00         22.9
3       Bankstown 2010-01-01 00:50:00         22.7
4       Bankstown 2010-01-01 01:00:00         22.6
...           ...                 ...          ...
220321  Bankstown 2021-03-17 23:00:00         19.1
220322  Bankstown 2021-03-17 23:20:00         19.0
220323  Bankstown 2021-03-17 23:30:00         18.8
220324  Bankstown 2021-03-17 23:34:00         18.8
220325  Bankstown 2021-03-18 00:00:00         18.6

[220326 rows x 3 columns]